'''
Площадь треугольника
Даны длины сторон треугольника. 
Вычислите площадь треугольника.

Тест 1
Входные данные:
3
4
5

Вывод программы:
6



Тест 2
Входные данные:
1
1
1

Вывод программы:
0.433013



Тест 3
Входные данные:
5
12
13

Вывод программы:
30
'''

a = int(input(""))
b = int(input(""))
c = int(input(""))

S = a * b * c
print(S)